Tekla Open API Reference for Tekla Structures 2025
BooleanConstantFilterExpression Constructor (Boolean)
 Initializes a new instance of the BooleanConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BooleanConstantFilterExpression(
	bool Value
)
Public Sub New (
	Value As Boolean
)
Parameters
Value
Type: System.Boolean
The value to represent.
See Also
Reference
BooleanConstantFilterExpression Class
BooleanConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace